# BuiltInFailures.ExternalResourceReferenceFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExternalResourceReferenceFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ExternalResourceReferenceFailures
```

Visual Basic
---
```text
Public NotInheritable Class ExternalResourceReferenceFailures
```

Visual C++
---
```text
public ref class ExternalResourceReferenceFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ExternalResourceReferenceFailures
# See Also
BuiltInFailures..::..ExternalResourceReferenceFailures Members
Autodesk.Revit.DB Namespace